{"index":{"slug":"index","filePath":"index.md","title":"Welcome to my digitial garden! 🪴🌱","links":[],"tags":[],"content":"This page is where I keep my notes. The graph on the right shows a map of the interconnections between subjects I have written about. Feel free to look around!"},"physics/berry_phase":{"slug":"physics/berry_phase","filePath":"physics/berry_phase.md","title":"Berry Phase","links":[],"tags":["Physics","Quantum-Mechanics","Condensed-Matter"],"content":"The general definition of the Berry phase is a phase angle (from 0 to 2\\pi) that a complex vector acquires as it is transported through a path in its complex vector space. The idea was popularized by Sir Michael Berry in 1984.\nTo demonstrate the Berry phase, we consider some state in Hilbert space (e.g. the ground state) of some system parameterized by a continuously varying parameter (e.g magnetic field, nuclear coordinates etc.). We then vary the parameter in a closed path, such that the system returns to where it started.\nAdiabatic Approximation\nIf the parameters very “slowly” with time, then energy eigenvalues should just follow the change in parameters. The eigenvectors will acquire an additional geometrical phase associated with the change in parameter.\nAssuming no degeneracy (so as to have constant ordering of states),the energy eigenstates are found from the time-independent Schrodinger equation\nH(t) |n; t\\rangle = E_n (t) |n; t\\rangle\nnoting that at any time t, the states and eigenvalues may change. The time-dependent Schrodinger equation for some arbitrary ket expanded in the energy eigenstates is\n\ti\\hbar \\frac{\\partial}{\\partial t} |\\alpha; t \\rangle = H(t) |\\alpha; t \\rangle\nwhere\n|\\alpha; t \\rangle = \\sum_{n} c_n (t) e^{i \\theta_n(t)} |n; t \\rangle\nand \\theta(t) is the typical dynamical phase acquired by the energy eigenstates\n\t\\theta_n (t) = -\\frac{1}{\\hbar} \\int_0 ^t E_n(t&#039;) dt&#039;\nThrough a straightforward substitution into the TDSE, taking the time-derivative of the TDSE, acting from the left with an equal time eigenstate, and using orthogonality of equal time eigenstates, one arrives at a differential equation for the coefficients,\n\\dot{c}_m(t) = -c_m(t) \\langle m;t| \\frac{\\partial}{\\partial t}|m; t\\rangle - \\sum_{n} c_n(t) e^{i(\\theta_n - \\theta_m)} \\frac{\\langle m;t| \\dot{H} | n;t\\rangle}{E_n(t) - E_m(t)}\nThe second term shows mixing with other states due to the time dependence of the Hamiltonian. This result is exact. The adiabatic approximation amounts to neglecting the second term, meaning\n\\frac{\\langle m;t| \\dot{H} | n;t\\rangle}{E_n(t) - E_m(t)} \\equiv\\frac{1}{\\tau} \\ll \\langle m;t| \\frac{\\partial}{\\partial t}|m; t\\rangle \\approx \\frac{E_m}{\\hbar}\nThe solution for the coefficients is then\nDiscrete formulation\nConsider N vectors |u_0\\rangle to |u_{N-1}\\rangle that describe the ground state of a system at each discrete step in parameter space, where the last state |u_{N}\\rangle is identified with |u_{0}\\rangle. The Berry phase is defined as\n\\phi = -Im \\ ln[ \\langle u_0 | u_1 \\rangle\\langle u_1|u_2 \\rangle \\cdots\\langle u_{N-1}|u_0 \\rangle]\nThe reason for the imaginary natural log is that for some complex number z = |z| e^{i\\phi}, Im\\ ln z = \\phi , so we only retain the information about its phase. This definition chooses a branch of Im \\ ln\\ z such that -\\pi &lt; \\phi \\leq \\pi. The minus sign is conventional. This formulation has the benefit that it is gauge independent.\nParallel-Transport Gauge\nWe are free to choose any gauge we like for each of the |u_j\\rangle . We can define new gauges s.t. |\\bar{u}_0\\rangle = |u_0\\rangle , then choose the phase of |u_1\\rangle such that \\langle \\bar{u}_0 | \\bar{u}_1\\rangle is real and positive. If we propagate this down the line of states, then\n\\text{Im}\\ \\text{ln} \\langle \\bar{u}_j | \\bar{u}_{j+1}\\rangle = 0\nThis generates what is known as the parallel transport gauge. In this gauge choice,|\\bar{u}_0 \\rangle is no longer equivalent to  |\\bar{u}_N \\rangle, and they differ by exactly the Berry phase\n\\phi = \\text{Im}\\ \\text{ln} \\langle \\bar{u}_N | \\bar{u}_{0}\\rangle\nThe phase difference of the states are exactly zero until an abrupt discontinuity at the end of the loop.\nTwisted Parallel-Transport Gauge\nWe may like to have a choice of phase that is continuous throughout the evolution of the state."},"physics/index":{"slug":"physics/index","filePath":"physics/index.md","title":"Physics notes","links":[],"tags":[],"content":""},"physics/topological_obstructions":{"slug":"physics/topological_obstructions","filePath":"physics/topological_obstructions.md","title":"Topological Obstructions","links":["physics/topological_quantum_chem"],"tags":["Physics","Condensed-Matter","Topological-Materials"],"content":"Ref: Topological Quantum Chemistry\nWannier functions of a topologically trivial group of bands are smoothly continuous to an atomic limit, are exponentially localized, and transform under a band representation.\nIn a topological material, the Wannier functions for the valence (group of) bands either fail to be exponentially localized or break the crystal symmetry. Some examples\n\nChern insulator: a non-vanishing Chern number indicates an obstruction to the formation of exponentially localized Wannier functions.\nIn the Kane-Mele model of graphene, within the Z_2 topological phase, exponentially localized Wannier functions (when the valence and conduction bands are taken together, atomic like Wannier functions can be formed) for the valence bands break time-reversal symmetry. Hence a gap must close to transition to the atomic limit.\n"},"physics/topological_quantum_chem":{"slug":"physics/topological_quantum_chem","filePath":"physics/topological_quantum_chem.md","title":"Topological Quantum Chemistry","links":["Wyckoff-Positions","physics/wannier_functions","Connectivity","Semimetals"],"tags":["Physics","Condensed-Matter","Topological-Materials"],"content":"Ref: Bradlyn et.al, Nature, 20 Jul 2017\n\nQuestion: Topological insulators represent only a few hundred of the 200,000 stoichiometric compounds. Why? Is there a problem with the band description of materials?\n\n\nChemists and physicists use fundamentally different viewpoints on materials\n\nphysicists: momentum space\nchemists: real space\n\n\nUnifying approach of real and reciprocal space is desired\n\nApproach\n\nCompile all possible ways energy bands in a solid can be connected in the BZ to obtain band structures in all non-magnetic space groups\n\nCrystal symmetries place constraints on allowed connections\nAt high symmetry k-points, Bloch functions are classified by irreducible representations of the symmetry group of \\vec{k_i} which also determine the degeneracy\nAway from these points, fewer constraints and degeneracies are lowered\nE.g.  \\vec{k}\\cdot\\vec{p} approach allows computation of band structure near high-symmetry points, group theory places constraints on how they can be connected\nUse graph theoretic problem of constructing multi-partite graphs\n\n\nDevelop tools to compute way in which real space orbitals determine symmetry character of electronic bands\n\nGiven Wyckoff Positions + orbital symmetry (s, p, d etc.)\nFind symmetry character of all bands throughout BZ\nExtend notion of band reps to materials with SOC and/or TRS\n\nband reps consist of all energy bands + Bloch functions arising from localized orbitals respecting crystal symmetry (+ maybe TRS )\nset of band reps \\subset set of groups of bands obtained from this new graph theory\n\n\nIdentify set of ==elementary band reps== (EBRs) corresponding to the smallest sets of bands that can be derived from Wannier Functions (10,403 of them \\forall space groups, Wyckoff pos, and orbitals)\n\nIf the number of e-’s is fraction of number of connected bands (Connectivity) that form EBR, then system is symmetry enforced semi-metal (Semimetals)\n\nlargest number of connected bands in EBR is 24, smallest fraction of filled bands in a semi-metal is 1/24\n\n\nIf number of connected bands is smaller than total number of bands in EBR, then momentum space description exists but Wannier one does not (topological)\n\nTopological insulators are those materials with bands not in the list of elementary components but that are in the graph enumeration\n\n\n\n\n\n\n\nGraph Theory and band structure\nConsider D dimensional crystal invariant under the action of a space group with elements \\{ R | \\vec{d}\\ \\} \\in G where R is a rotation or rotoinversion \\vec{d} is a translation such that \\{ R | \\vec{d}\\ \\} \\vec{x} = R\\vec{x} + \\vec{d} . The Bravais lattice of a space group is generated by a set of linearly independent translations \\{E|\\vec{t}_i\\} , i=1, \\cdots , D where E is the identity.\nEach \\vec{k} in the BZ remains invariant up to translation by reciprocal lattice vector under action of symmetry elements in its little group G_\\vec{k} \\subset G.The Bloch wavefunctions |u_{n\\vec{k}}\\rangle transform under a sum of irreps of G_{\\vec{k}}\n\nBands at high symmetry points will have non-accidental degeneracies equal to dimension of the representations\nSpinless and SOC absent systems have ordinary linear reps\nSystems with SOC have double-valued reps\n"},"physics/wannier_functions":{"slug":"physics/wannier_functions","filePath":"physics/wannier_functions.md","title":"Wannier Functions","links":["physics/topological_obstructions"],"tags":["Physics","Condensed-Matter"],"content":"Wannier functions are the localized representation of the Bloch energy eigenstates of a periodic crystal. They effectively are related to a given Bloch energy eigenstate through a Fourier transform\n\\begin{align}\n|w_{n\\vec{R}}\\rangle &amp;= \\frac{V_{cell}}{(2\\pi)^3} \\int_{BZ} e^{-i\\vec{k}\\cdot\\vec{R}}\\ |\\psi_{n\\vec{k}}\\rangle d^3k \\\\\n|\\psi_{n, \\vec{k}} \\rangle &amp;= \\sum_{\\vec{R}}e^{i\\vec{k}\\cdot\\vec{R}}\\ |w_{n, \n\\vec{k}} \\rangle\n\\end{align}\nAs long as the Bloch eigenstates are a smooth function of \\vec{k}, then the Wannier representation decays rapidly with |\\vec{r} -\\vec{R}|  for some given \\vec{R} associated with the Wannier state.\nThe Fourier transform is a special case of a unitary transformation, so we can view the Bloch and Wannier functions as providing two different bases describing the same manifold of states associated with an energy band. Another way of saying this is that the projector onto band n is unitarily equivalent,\n\\mathcal{P}_n = \\frac{V_{cell}}{(2\\pi)^3} \\int_{BZ} |\\psi_{n\\vec{k}}\\rangle\\langle \\psi_{n\\vec{k}}| d^3k = \\sum_{\\vec{R}} |w_{n\\vec{R}}\\rangle \\langle w_{n\\vec{k}}|\nMultiple Bands\nThe assumption that the Bloch eigenstates are smooth and periodic in \\vec{k} is based on the assumption that there are no degeneracies. However this is uncommon, there are typically degeneracies at high-symmetry points in the BZ. We can instead consider a group of J ordered bands that are separated by a finite energy gap from other bands. In insulators, the set of bands non-degenerate with the complementary set of bands will typically be the occupied band subspace. What we then seek is a set of J Wannier functions spanned by the J Bloch eigenstates constructed as,\n|w_{n,\\vec{R}}\\rangle = \\frac{V_{cell}}{(2\\pi)^3}\\int_{BZ}e^{-i\\vec{k}\\cdot\\vec{R}}\n|\\tilde{\\psi}_{n, \\vec{k}}\\rangle\\  d^3k\nwhere the |\\tilde{\\psi}_{n, \\vec{k}}\\rangle are smooth functions of \\vec{k} everywhere in the BZ that are related to the true Bloch energy eigenstates via a unitary transform\n|\\tilde{\\psi}_{n\\vec{k}}\\rangle = \\sum_{m=1}^{J}U_{mn}(\\vec{k})|\\psi_{m, \\vec{k}}\\rangle\nThe manifold of J \\times J unitary matrices U_{mn}(\\vec{k}) have been chosen to “iron out” the non-analytic behavior near the degeneracies at high symmetry points. Then, the Wannier functions will be exponentially localized. The cell-periodic wavefunctions |u_{n,\\vec{k}}\\rangle transform in the same way as the Bloch eigenstates,\n|\\tilde{u}_{n\\vec{k}}\\rangle = \\sum_{m=1}^{J} U_{mn}(\\vec{k}) |u_{m\\vec{k}}\\rangle\nThis is known as a multiband or non-Abelian gauge transformation. It is not obvious whether this procedure is always possible. It can always be accomplished in localized region around some \\vec{k_0}, where we choose a set |\\tilde{u}_{n\\vec{k}}\\rangle of orthonormal functions spanning the band subspace of H_{\\vec{k_0}}, being either the eigenstates themselves or some unitary rotation of them. We then choose at each nearby \\vec{k} a unitary rotation on the energy eigenstates |u_{n\\vec{k}}\\rangle  such that they are “optimally aligned” with |\\tilde{u}_{n\\vec{k_0}}\\rangle.\nOptimal Alignment\nGiven two sets of orthonormal sets of J  states |u_n\\rangle and |\\nu_n\\rangle, where the subspaces  \\mathcal{P}_u = \\sum |u_n\\rangle \\langle u_n | and \\mathcal{P}_{\\nu} = \\sum |\\nu_n\\rangle \\langle \\nu_n| spanned by these states are similar but not identical. We would like to rotate one set such that they are as similar to the other as possible in both phase and character.\nOptimal alignment occurs when\n\\tilde{M}_{mn} = \\langle u_m| \\tilde{v}_n \\rangle\nis as close to the unit matrix as possible. Initially, before the unitary rotation,\nM_{mn} = \\langle u_m | \\nu_n \\rangle\nWe then perform a SVD on M\nM = V\\Sigma W^{\\dagger}\nwhere V and W are J\\times J unitary matrices and \\Sigma_{mn} = s_n \\delta_{nm} is a diagonal matrix whose elements s_n \\in \\mathcal{R} \\gt 0 are called “singular values”. One can show that if we apply V to the set of states \\{ |u_n\\rangle \\} and W to the set of states \\{ |\\nu_n\\rangle \\} we get new states\n\\begin{align}\n|u&#039;_n \\rangle &amp;= \\sum_m V_{mn} |u_m\\rangle \\\\\n|\\nu&#039;_n \\rangle &amp;= \\sum_m W_{mn} |\\nu_m\\rangle\n\\end{align}\nthat are optimally aligned in the sense that\nM&#039; = \\langle u&#039;_m | \\nu&#039;_n \\rangle = s_n \\delta_{mn}\nThe extent to which s_n \\lt 1 is a measure of the difference between \\mathcal{P}_u and \\mathcal{P}_{\\nu}. Since we are given |u_n\\rangle and they shouldn’t be rotated, we apply V^{\\dagger} to both sets, returning |u&#039;_n \\rangle back to |u_n\\rangle and\n|\\tilde{\\nu}_n\\rangle = \\sum_m (WV^{\\dagger})_{mn} | \\nu_m \\rangle\nwhich are in optimal alignment with the initial |u_n\\rangle. We also can think about the procedure as constructing the best unitary approximation to M\n\\mathcal{M} = VW^{\\dagger}\nthat tells us how the states |u_n\\rangle got rotated in going to the |\\nu_n\\rangle. We then apply the h.c. to undo this rotation. If any of the s_n = 0 than there is a subspace of vectors in \\mathcal{P}_{\\nu} that are orthogonal to the space spanned by \\mathcal{P}_u so they can’t be aligned.\nProjection method\nThe procedure of optimal alignment works locally in k but whether there is always a way to do this globally is highly non-trivial. One way of practically constructing multiband Wannier functions is via the projection method.\n\nChoose a set of J localized “trial functions” |t_n \\rangle whose locations and characters are similar to the expected Wannier functions\nExpand this set of functions to include periodic images |t_{n\\vec{R}}\\rangle and construct Bloch like functions |\\chi_{n\\vec{k}}\\rangle = \\sum_{\\vec{R}} e^{i\\vec{k}\\cdot\\vec{R}} |t_{n\\vec{R}}\\rangle that are smooth in \\vec{k}\nOrthonormalize them at each \\vec{k} via computing the overlap matrix S^{(\\vec{k})}_{mn} = \\langle \\chi_{m\\vec{k}} | \\chi_{n\\vec{k}}\\rangle and construct |\\chi&#039;_{n\\vec{k}}\\rangle = \\sum_m (S_{\\vec{k}}^{-1/2})_{mn} |\\chi_{m \\vec{k}}\\rangle\nPerform J\\times J unitary rotation on the |\\psi_{n\\vec{k}}\\rangle so as to obtain |\\tilde{\\psi}_{n\\vec{k}}\\rangle that are optimally aligned with the |\\chi&#039;_{n\\vec{k}}\\rangle using the optimal alignment\nFor some choices of trial functions, |\\chi_{n\\vec{k}}\\rangle are not linearly independent and S_{\\vec{k}} becomes singular and the procedure fails. For ordinary insulators, the procedure can be fixed via a new choice of trial function. In certain kinds of topological insulators, there can be a topological obstruction; in this case a singularity in S_{\\vec{k}} is gauranteed to occur somewhere in the BZ.\n\nLocalization\nWannier interpolation"}}