{"berry_phase":{"slug":"berry_phase","filePath":"berry_phase.md","title":"Berry Phase","links":[],"tags":["Quantum-Mechanics"],"content":"The general definition of the Berry phase is a phase angle (from 0 to 2\\pi) that a complex vector acquires as it is transported through a path in its complex vector space. The idea was popularized by Sir Michael Berry in 1984.\nTo demonstrate the Berry phase, we consider some state in Hilbert space (e.g. the ground state) of some system parameterized by a continuously varying parameter (e.g magnetic field, nuclear coordinates etc.). We then vary the parameter in a closed path, such that the system returns to where it started.\nAdiabatic Approximation\nIf the parameters very “slowly” with time, then energy eigenvalues should just follow the change in parameters. The eigenvectors will acquire an additional geometrical phase associated with the change in parameter.\nAssuming no degeneracy (so as to have constant ordering of states),the energy eigenstates are found from the time-independent Schrodinger equation\nH(t) |n; t\\rangle = E_n (t) |n; t\\rangle\nnoting that at any time t, the states and eigenvalues may change. The time-dependent Schrodinger equation for some arbitrary ket expanded in the energy eigenstates is\n\ti\\hbar \\frac{\\partial}{\\partial t} |\\alpha; t \\rangle = H(t) |\\alpha; t \\rangle\nwhere\n|\\alpha; t \\rangle = \\sum_{n} c_n (t) e^{i \\theta_n(t)} |n; t \\rangle\nand \\theta(t) is the typical dynamical phase acquired by the energy eigenstates\n\t\\theta_n (t) = -\\frac{1}{\\hbar} \\int_0 ^t E_n(t&#039;) dt&#039;\nThrough a straightforward substitution into the TDSE, taking the time-derivative of the TDSE, acting from the left with an equal time eigenstate, and using orthogonality of equal time eigenstates, one arrives at a differential equation for the coefficients,\n\\dot{c}_m(t) = -c_m(t) \\langle m;t| \\frac{\\partial}{\\partial t}|m; t\\rangle - \\sum_{n} c_n(t) e^{i(\\theta_n - \\theta_m)} \\frac{\\langle m;t| \\dot{H} | n;t\\rangle}{E_n(t) - E_m(t)}\nThe second term shows mixing with other states due to the time dependence of the Hamiltonian. This result is exact. The adiabatic approximation amounts to neglecting the second term, meaning\n\\frac{\\langle m;t| \\dot{H} | n;t\\rangle}{E_n(t) - E_m(t)} \\equiv\\frac{1}{\\tau} \\ll \\langle m;t| \\frac{\\partial}{\\partial t}|m; t\\rangle \\approx \\frac{E_m}{\\hbar}\nThe solution for the coefficients is then\nDiscrete formulation\nConsider N vectors |u_0\\rangle to |u_{N-1}\\rangle that describe the ground state of a system at each discrete step in parameter space, where the last state |u_{N}\\rangle is identified with |u_{0}\\rangle. The Berry phase is defined as\n\\phi = -Im \\ ln[ \\langle u_0 | u_1 \\rangle\\langle u_1|u_2 \\rangle \\cdots\\langle u_{N-1}|u_0 \\rangle]\nThe reason for the imaginary natural log is that for some complex number z = |z| e^{i\\phi}, Im\\ ln z = \\phi , so we only retain the information about its phase. This definition chooses a branch of Im \\ ln\\ z such that -\\pi &lt; \\phi \\leq \\pi. The minus sign is conventional. This formulation has the benefit that it is gauge independent.\nParallel-Transport Gauge\nWe are free to choose any gauge we like for each of the |u_j\\rangle . We can define new gauges s.t. |\\bar{u}_0\\rangle = |u_0\\rangle , then choose the phase of |u_1\\rangle such that \\langle \\bar{u}_0 | \\bar{u}_1\\rangle is real and positive. If we propagate this down the line of states, then\n\\text{Im}\\ \\text{ln} \\langle \\bar{u}_j | \\bar{u}_{j+1}\\rangle = 0\nThis generates what is known as the parallel transport gauge. In this gauge choice,|\\bar{u}_0 \\rangle is no longer equivalent to  |\\bar{u}_N \\rangle, and they differ by exactly the Berry phase\n\\phi = \\text{Im}\\ \\text{ln} \\langle \\bar{u}_N | \\bar{u}_{0}\\rangle\nThe phase difference of the states are exactly zero until an abrupt discontinuity at the end of the loop.\nTwisted Parallel-Transport Gauge\nWe may like to have a choice of phase that is continuous throughout the evolution of the state."},"index":{"slug":"index","filePath":"index.md","title":"Trey Cole","links":[],"tags":["example-tag"],"content":"Helo"}}